In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [69]:
df=pd.read_csv('tips.csv')
print(df.head())
print(df['tip'].max())
print(df['tip'].min())
print(df['tip'].mean())
print(df['tip'].median())
print(df['tip'].mode())
print(df['tip'].std())
print(df['tip'].var())

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
10.0
1.0
2.99827868852459
2.9
0    2.0
Name: tip, dtype: float64
1.383638189001182
1.9144546380624707

In [70]:
print(df['tip'].describe()) 
print(len(df[['tip','sex','size']][df['sex']=='Female']))
print(df[['tip','sex','size']][df['sex']=='Female'])
print(df.shape)

count    244.000000
mean       2.998279
std        1.383638
min        1.000000
25%        2.000000
50%        2.900000
75%        3.562500
max       10.000000
Name: tip, dtype: float64
88
      tip     sex  size
0    1.01  Female     2
4    3.61  Female     4
11   5.00  Female     4
14    NaN  Female     2
15   3.02  Female     2
..    ...     ...   ...
227  2.00  Female     2
230  2.88  Female     2
239  4.67  Female     3
241  2.00  Female     2
244  3.00  Female     2

[88 rows x 3 columns]
(245, 7)

In [71]:
print(df['tip'].mean())
df.fillna(0,inplace=True)
print(df['tip'].mean())

2.99827868852459
2.9860408163265304

In [72]:
weather_data={
    'day':['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature':[32,35,28,24,32,31],
    'windspeed':[6,7,2,7,4,2],
    'event':['Rain','Sunny','Snow','Snow','Rain','Sunny']
}

df=pd.DataFrame(weather_data)
# df.head(2)
df[:]
# df.to_csv('weather_data.csv',index=False)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [73]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [74]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [75]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [76]:
type(df['event'])

pandas.core.series.Series

In [77]:
df[['event','day']].describe()

       event       day
count      6         6
unique     3         6
top     Rain  1/1/2017
freq       2         1

In [78]:
df[['day','temperature','event']][df.temperature==df.temperature.max()]

        day  temperature  event
1  1/2/2017           35  Sunny

In [79]:
df.set_index('day',inplace=True)

In [80]:
df.loc['1/3/2017']

temperature      28
windspeed         2
event          Snow
Name: 1/3/2017, dtype: object

In [81]:
df.reset_index(inplace=True)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [10]:
rain_data={
    ('1/2/2024','Sunny','32'),
    ('1/3/2024','Rain','35'),
    ('1/4/2024','Snow','28'),
    ('1/5/2024','Snow','24'),
    ('1/6/2024','Rain','32'),
    ('1/7/2024','Sunny','31')
}

df=pd.DataFrame(rain_data,columns=['day','event','temperature'])
df

        day  event temperature
0  1/4/2024   Snow          28
1  1/6/2024   Rain          32
2  1/3/2024   Rain          35
3  1/5/2024   Snow          24
4  1/2/2024  Sunny          32
5  1/7/2024  Sunny          31

In [16]:
student_data=[
    {'name':'John','age':15},
    {'name':'Sam','age':16},
    {'name':'Tom','age':17},
    {'name':'Jerry','age':18},
    {'name':'Tim','age':19},
    {'name':'Jim','age':20}
]

df=pd.DataFrame(student_data)
df

    name  age
0   John   15
1    Sam   16
2    Tom   17
3  Jerry   18
4    Tim   19
5    Jim   20

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [ ]:
# read_csv()
# read_excel()
# Some important parameters
# skiprows
# header=None
# names=['a','b','c']
# nrows=5
# na_values=['not available','n.a.','NA',-1]
# na_values={'a':['not available','n.a.','NA',-1],'b':['not available','n.a.','NA',-1]}
# columns=['a','b','c']
# converters={'a':convert_currency}
# converters={'a':lambda x: x*2}

# df.to_excel('student_data.xlsx',sheet_name='student',startrow=1,startcol=2,index=False)

#df.fillna(0,inplace=True)
#df['age'].fillna(0,inplace=True)
# df.fillna({
#     'name':'No Name',
#     'age':0
# },inplace=True)

# df['age'].replace(0,15,inplace=True)
# df.fillna(method='ffill',inplace=True) #forward fill
# df.fillna(method='bfill',inplace=True) #backward fill
# df.fillna(method='ffill',limit=1,inplace=True) #forward fill
# df.fillna(method='bfill',limit=1,inplace=True) #backward fill
# df.interpolate()
# df.dropna()
# df.dropna(how='all')
# df.dropna(thresh=1)
# df.dropna(subset=['name'])
# df.dropna(subset=['name','age'])
# df.dropna(axis=1)
# df.replace('n.a.',np.NaN)
# df.replace(['n.a.','NA'],np.NaN)
# df.replace({
#     'name':'n.a.',
#     'age':'NA'
# },np.NaN)

#df.replace('[A-Za-z]','',regex=True)
#df.replace({
#     'temperature':'[A-Za-z]'
# },'',regex=True)
#df.replace(['Rain','Sunny','Snow'],[0,1,2])
#df.replace({
#     'event':'[A-Za-z]'
# },'',regex=True)

In [70]:
# dropna , fillna, interpolate, replace
data={
    'name':['Tom','Jerry','Tim','Jim','John','Sam', "Minav"],
    'age':[15,16,17,18,19,20, None],
    'score':[45,67,89,90,78,56, None]
}

df=pd.DataFrame(data)
# df.dropna(how='all',inplace=True)
# df.fillna(0,inplace=True)
# df.interpolate()
df.dropna(thresh=1,inplace=True)
df

    name   age  score
0    Tom  15.0   45.0
1  Jerry  16.0   67.0
2    Tim  17.0   89.0
3    Jim  18.0   90.0
4   John  19.0   78.0
5    Sam  20.0   56.0
6  Minav   NaN    NaN

In [38]:
# Split Apply Combine

data={
    'name':['John','Sam','Tom','Jerry','Tim','Jim','John','Sam','Tom','Jerry','Tim','Jim'],
    'car_no':[15,16,17,18,19,20,2008,2009,2010,2011,2012,2013],
    

}

df=pd.DataFrame(data, columns=['name','car_no'], index=None)

g= df.groupby('name')
for event, event_df in g:
    print(event)
    print(event_df)

Jerry
    name  car_no
3  Jerry      18
9  Jerry    2011
Jim
   name  car_no
5   Jim      20
11  Jim    2013
John
   name  car_no
0  John      15
6  John    2008
Sam
  name  car_no
1  Sam      16
7  Sam    2009
Tim
   name  car_no
4   Tim      19
10  Tim    2012
Tom
  name  car_no
2  Tom      17
8  Tom    2010

In [71]:
print(g.get_group('John'))
g.max()

   name  car_no
0  John      15
6  John    2008

       car_no
name
Jerry    2011
Jim      2013
John     2008
Sam      2009
Tim      2012
Tom      2010

In [40]:
g.mean()

       car_no
name
Jerry  1014.5
Jim    1016.5
John   1011.5
Sam    1012.5
Tim    1015.5
Tom    1013.5